{"config": [{"config": {"border_mode": "same", "input_dtype": "float32", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Convolution2D"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "same", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "same", "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 128, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "same", "trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 256, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "same", "trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 256, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 128, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 64, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 0.30000001192092896, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 1, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}